/**
 * 
 */
package com.huaban.analysis.jieba;

import java.io.File;
import java.io.InputStream;
import java.net.URL;
import java.nio.charset.StandardCharsets;
import java.nio.file.Paths;
import java.util.ArrayList;
import java.util.List;
import java.util.Locale;
import java.util.stream.Collectors;

import com.huaban.analysis.jieba.viterbi.FinalSeg;
import junit.framework.TestCase;

import org.junit.Test;

import com.huaban.analysis.jieba.JiebaSegmenter.SegMode;


/**
 * @author matrix
 * 
 */
public class JiebaSegmenterTest extends TestCase {
    private JiebaSegmenter segmenter = new JiebaSegmenter();
    String[] sentences =
            new String[] {
                          "找小姐",
                          "找美女",
                          "找小妹",
                          "学生妹",
                          "职业狐狸精",
                          "男公关",
                          "上门",
                          "抽獎",
                          "好声音",
                          "好聲音",
                          "夢之声",
                          "夢之聲",
                          "訂票",
                          "改簽",
                          "熱线",
                          "熱線",
                          "热線",
                          "電话",
                          "電話",
                          "醫院",
                          "代刷",
                          "撲剋牌",
                          "137-1234-1234",
                          "这是一个伸手不见五指的黑夜。我叫孙悟空，我爱北京，我爱Python和C++。",
                          "我不喜欢日本和服。",
                          "雷猴回归人间。",
                          "工信处女干事每月经过下属科室都要亲口交代24口交换机等技术性器件的安装工作",
                          "我需要廉租房",
                          "永和服装饰品有限公司",
                          "我爱北京天安门",
                          "abc",
                          "隐马尔可夫",
                          "雷猴是个好网站",
                          "“,”和“SOFTware（软件）”两部分组成",
                          "草泥马和欺实马是今年的流行词汇",
                          "伊藤洋华堂总府店",
                          "中国科学院计算技术研究所",
                          "罗密欧与朱丽叶",
                          "我购买了道具和服装",
                          "PS: 我觉得开源有一个好处，就是能够敦促自己不断改进，避免敞帚自珍",
                          "湖北省石首市",
                          "湖北省十堰市",
                          "总经理完成了这件事情",
                          "电脑修好了",
                          "做好了这件事情就一了百了了",
                          "人们审美的观点是不同的",
                          "我们买了一个美的空调",
                          "线程初始化时我们要注意",
                          "一个分子是由好多原子组织成的",
                          "祝你马到功成",
                          "他掉进了无底洞里",
                          "中国的首都是北京",
                          "孙君意",
                          "外交部发言人马朝旭",
                          "领导人会议和第四届东亚峰会",
                          "在过去的这五年",
                          "还需要很长的路要走",
                          "60周年首都阅兵",
                          "你好人们审美的观点是不同的",
                          "买水果然后来世博园",
                          "买水果然后去世博园",
                          "但是后来我才知道你是对的",
                          "存在即合理",
                          "的的的的的在的的的的就以和和和",
                          "I love你，不以为耻，反以为rong",
                          "因",
                          "",
                          "hello你好人们审美的观点是不同的",
                          "很好但主要是基于网页形式",
                          "hello你好人们审美的观点是不同的",
                          "为什么我不能拥有想要的生活",
                          "后来我才",
                          "此次来中国是为了",
                          "使用了它就可以解决一些问题",
                          ",使用了它就可以解决一些问题",
                          "其实使用了它就可以解决一些问题",
                          "好人使用了它就可以解决一些问题",
                          "是因为和国家",
                          "老年搜索还支持",
                          "干脆就把那部蒙人的闲法给废了拉倒！RT @laoshipukong : 27日，全国人大常委会第三次审议侵权责任法草案，删除了有关医疗损害责任“举证倒置”的规定。在医患纠纷中本已处于弱势地位的消费者由此将陷入万劫不复的境地。 ",
                          "大", "", "他说的确实在理", "长春市长春节讲话", "结婚的和尚未结婚的", "结合成分子时", "旅游和服务是最好的", "这件事情的确是我的错",
                          "供大家参考指正", "哈尔滨政府公布塌桥原因", "我在机场入口处", "邢永臣摄影报道", "BP神经网络如何训练才能在分类时增加区分度？",
                          "南京市长江大桥", "应一些使用者的建议，也为了便于利用NiuTrans用于SMT研究", "长春市长春药店", "邓颖超生前最喜欢的衣服",
                          "胡锦涛是热爱世界和平的政治局常委", "程序员祝海林和朱会震是在孙健的左面和右面, 范凯在最右面.再往左是李松洪", "一次性交多少钱",
                          "两块五一套，三块八一斤，四块七一本，五块六一条", "小和尚留了一个像大和尚一样的和尚头", "我是中华人民共和国公民;我爸爸是共和党党员; 地铁和平门站",
                          "张晓梅去人民医院做了个B超然后去买了件T恤", "AT&T是一件不错的公司，给你发offer了吗？",
                          "C++和c#是什么关系？11+122=133，是吗？PI=3.14159", "你认识那个和主席握手的的哥吗？他开一辆黑色的士。", "枪杆子中出政权",
                          "鲜芋仙 3" };
    String[] longSentences = new String[] {
	    "我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信我他妈偏不信",
    };


    @Override
    protected void setUp() throws Exception {
        WordDictionary.getInstance().init("/conf/sougou.dict","/conf/user.dict");
    }


    @Override
    protected void tearDown() throws Exception {
        super.tearDown();
    }


    @Test
    public void testCutForSearch() {
        for (String sentence : sentences) {
            List<SegToken> tokens = segmenter.process(sentence, SegMode.SEARCH);
            System.out.print(String.format(Locale.getDefault(), "\n%s\n%s", sentence, tokens.toString()));
        }
    }

    @Test
    public void testCut() {
        List<String> keywordList = new ArrayList<>();
        /*keywordList.add("英语六年级下册");
        keywordList.add("大气环境");
        keywordList.add("三国演义 人民文学");
        keywordList.add("雪国之劫");
        keywordList.add("法律适用书籍");
        keywordList.add("道德与法治三年级");
        keywordList.add("破案科学：侦查逻辑与经验");
        keywordList.add("简爱");
        keywordList.add("能力培养与测试:物理");
        keywordList.add("写给孩子们的好童诗");
        keywordList.add("韩国史");
        keywordList.add("卫生健康常用法律法规汇编");
        keywordList.add("历史的填空人民文学");
        keywordList.add("抖音营叶澜：《教育概论》，人民教育出版社，2006年版销");
        keywordList.add("现代局部战争装备运用与保障战例研");
        keywordList.add("工业机器人性能测试技术浙江大学出版社");
        keywordList.add("一级建造师考试市政辅导用书");
        keywordList.add("中华人民共和国民法典");
        keywordList.add("新思路辅导与训练 数学六年级");
        keywordList.add("狐狸和仙鹤");
        keywordList.add("汪汪队立大功中英双语有声故事书(10册)");
        keywordList.add("湖北省事业单位公共基础知识");
        keywordList.add("混凝土质量控制标准");
        keywordList.add("将无同");
        keywordList.add("这题超纲了");
        keywordList.add("破云");
        keywordList.add("破云,将无同,这题超纲了");
        keywordList.add("从小学电脑");
        keywordList.add("魏东海");
        keywordList.add("栝楼生产技术");
        keywordList.add("世说新语朱碧莲");
        keywordList.add("曹操传");
        keywordList.add("曹操的诗");
        keywordList.add("冷场");*/
        keywordList.add("笨狼的故事");
        keywordList.add("乖乖狗写给孩子们的好童诗");
        keywordList.add("大冰好吗");
        keywordList.add("万多亿写给孩子们的好童诗");
        keywordList.add("万多亿写给孩子们的好童诗");
        keywordList.add("用百度写给孩子们的好童诗");
        keywordList.add("座火写给孩子们的好童诗");
        keywordList.add("汤小团第七卷");
        keywordList.add("作弄人写给孩子们的好童诗");
        keywordList.add("晴天下猪系列");
        keywordList.add("华西日历辟谣小分队健康日历 2021");
        keywordList.add("小狗钱钱");
        WordDictionary.getInstance().addUserWord("笨狼");
        WordDictionary.getInstance().addUserWord("微积分习题集");
        //WordDictionary.getInstance().addUserWord("大冰");
        //WordDictionary.getInstance().addUserWord("晴天下猪");
        //WordDictionary.getInstance().addUserWord("天下");

        for (String keyWords : keywordList) {
            System.out.println("keyword：" + keyWords);
            List<SegToken> tokens = segmenter.process(keyWords, SegMode.SEARCH);
            System.out.println(String.join(",",tokens.stream().map(e->e.word).filter(e->e.length()>1).collect(Collectors.toList())));
        }
    }
    @Test
    public void testCutForIndex() {
        for (String sentence : sentences) {
            List<SegToken> tokens = segmenter.process(sentence, SegMode.INDEX);
            System.out.print(String.format(Locale.getDefault(), "\n%s\n%s", sentence, tokens.toString()));
        }
    }


    @Test
    public void testBugSentence() {
        String[] bugs =
                new String[] {
                              "UTF-8",
                              "iphone5",
                              "鲜芋仙 3",
                              "RT @laoshipukong : 27日，",
                              "AT&T是一件不错的公司，给你发offer了吗？",
                              "干脆就把那部蒙人的闲法给废了拉倒！RT @laoshipukong : 27日，全国人大常委会第三次审议侵权责任法草案，删除了有关医疗损害责任“举证倒置”的规定。在医患纠纷中本已处于弱势地位的消费者由此将陷入万劫不复的境地。 " };
        for (String sentence : bugs) {
            List<SegToken> tokens = segmenter.process(sentence, SegMode.SEARCH);
            System.out.print(String.format(Locale.getDefault(), "\n%s\n%s", sentence, tokens.toString()));
        }
    }


    @Test
    public void testSegmentSpeed() {
        long length = 0L;
        long wordCount = 0L;
        long start = System.currentTimeMillis();
        for (int i = 0; i < 2000; ++i)
            for (String sentence : sentences) {
                segmenter.process(sentence, SegMode.INDEX);
                length += sentence.getBytes(StandardCharsets.UTF_8).length;
                wordCount += sentence.length();
            }
        long elapsed = (System.currentTimeMillis() - start);
        System.out.println(String.format(Locale.getDefault(), "time elapsed:%d, rate:%fkb/s, sentences:%.2f/s", elapsed,
            (length * 1.0) / 1024.0f / (elapsed * 1.0 / 1000.0f), wordCount * 1000.0f / (elapsed * 1.0)));
    }


    @Test
    public void testLongTextSegmentSpeed() {
        long length = 0L;
        long wordCount = 0L;
        long start = System.currentTimeMillis();
        for (int i = 0; i < 100; ++i)
            for (String sentence : longSentences) {
                segmenter.process(sentence, SegMode.INDEX);
                length += sentence.getBytes(StandardCharsets.UTF_8).length;
                wordCount += sentence.length();
            }
        long elapsed = (System.currentTimeMillis() - start);
        System.out.println(String.format(Locale.getDefault(), "time elapsed:%d, rate:%fkb/s, sentences:%.2f/s", elapsed,
            (length * 1.0) / 1024.0f / (elapsed * 1.0 / 1000.0f), wordCount * 1000.0f / (elapsed * 1.0)));
    }
}
